# -*- coding: utf-8 -*-
import string

alf = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя"

text1 = "блюншж явфвн, бйёпнёж яиэбёйёнляёф! оплизкриоь о еэбэфвж, злабэ кэ яштлбв квжнлккэь овпщ блидкэ яшбэяэпщ кв плищзл зиэоо (зиэооёсёзэуёь) ё кв мнлопл фёоил (нванвооёь). кэ яштлбв крдкл ялеянэцэпщ x, y, width, height ё зиэоо люкэнрдвкклал кэ зэнпёкзв лючвзпэ (ёиё зллнбёкэпш плфвз злкпрнля ъплал лючвзпэ, э-иь овайвкпэуёь)"
text2 = "эзъйфг эюжх. зйьщжвбщлзйф дмйкзы ийюэезавев люёф ийзюдлзы из дмйкм ai, зжв ы щллщрю. цлз жюзъшбщлюехжфю люёф, ыф ёзаюлю ыфъйщлх ечъмч кызч."
text3 = "зрмцфмн ёпдзмрмфтёмы, зиса зтефян. ря х ёдрм еихизтёдпм ут очфхч фтхд отедпац. утпстъисстн уфтжфдрря рси сднцм си чздптха, пмьа цтпаот офдцомн упдс очфхд:"
text4 = "зтефян зиса. ёт ёпткисмм сдьи отррифыихоти уфизпткисми ут утотумнстрч техпчкмёдсмв. д цдоки хумхто уфизтхцдёпгирящ сдрм чхпчж. ечзир фдзя здпасиньирч уптзтцётфстрч хтцфчзсмыихцёч!"
text5 = "сьоюьт баюь. обсйат сьоюи этютшцыбай каьа внчщ ын ятюптю. каь сщм ныыи п кщтшаюцшб ьэцяныцт ыьътышщнабюи ынсь хнамыбай."
text6 = "упьлнэюняхюр, пшфюьфх! шрщк уъняю щлюлчзк эрьоррнщл. к кнчкйэз ъафвфлчзщжш ыьрпэюлнфюрчршцьяыщъх ыьъфунъпэюнрщщъ- чъофэюфгрэцъх цъшылщфф. улщфшлршэк ыъэюлнцлшфыъ йоя ьъээфф."
text7 = "тэпяйш туьк. рэ юуярйд samsung ai юяэрэтчб тън ьо 10сэ ыоабуя щъоаа р ысв."
text8 = "ощлыёф мпвпы, очуэыуф мцкоучуыщмув! ъщоьхксуэп, хщнок ю шкь люопэ ьцпоюидпп ткшйэуп?"
text9 = "ощлыёф опшж. мкг ъщвэщмёф йдух кхэумуыщмкцу."
text10 = "чвфдоэ чшбп, жхуъушаоэ юяьшбё ! х гдвчвяъшбьш булшцв е хуаь чьуявцу- бугдухятс булш гдшчявъшбьш гв гвчюяскшбьс ьбёшдбшёу чят хулшэ вдцубьыуйьь!"

def decrypt(number,text):
    for change in range(1, 32):
        result = ""
        for i in text:
            if alf.find(i) != -1:
                j = alf.find(i)
                j = (j - change + len(alf)) % len(alf)
                result = result + alf[j]
            else:
                result = result + i
        if (result.find("добр") != -1) or (result.find("здравствуйте") != -1):
            print(number, "| Сдвиг:", change, "| Текст:", result)
    return -1

decrypt("1",text1)
decrypt("2",text2)
decrypt("3",text3)
decrypt("4",text4)
decrypt("5",text5)
decrypt("6",text6)
decrypt("7",text7)
decrypt("8",text8)
decrypt("9",text9)
decrypt("10",text10)
